Revit 2024 API
ParameterTypeId.RevisionCloudRevisionNum Property
 "Revision Number"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId RevisionCloudRevisionNum { get; }
Visual Basic
Public Shared ReadOnly Property RevisionCloudRevisionNum As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ RevisionCloudRevisionNum {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace